## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be created
+   resource "google_container_cluster" "primary" {
+       cluster_ipv4_cidr           = (known after apply)
+       datapath_provider           = (known after apply)
+       default_max_pods_per_node   = 110
+       enable_binary_authorization = false
+       enable_intranode_visibility = (known after apply)
+       enable_kubernetes_alpha     = false
+       enable_legacy_abac          = false
+       enable_shielded_nodes       = true
+       endpoint                    = (known after apply)
+       id                          = (known after apply)
+       label_fingerprint           = (known after apply)
+       location                    = "us-central1"
+       logging_service             = "logging.googleapis.com/kubernetes"
+       master_version              = (known after apply)
+       min_master_version          = "1.24.3-gke.2100"
+       monitoring_service          = "monitoring.googleapis.com/kubernetes"
+       name                        = "cinema"
+       network                     = "projects/terrateam-362405/global/networks/production"
+       networking_mode             = (known after apply)
+       node_locations              = [
+           "us-central1-a",
+           "us-central1-b",
+           "us-central1-f",
        ]
+       node_version                = (known after apply)
+       operation                   = (known after apply)
+       private_ipv6_google_access  = (known after apply)
+       project                     = "terrateam-362405"
+       remove_default_node_pool    = false
+       self_link                   = (known after apply)
+       services_ipv4_cidr          = (known after apply)
+       subnetwork                  = "projects/terrateam-362405/regions/us-central1/subnetworks/production"
+       tpu_ipv4_cidr_block         = (known after apply)

+       addons_config {
+           cloudrun_config {
+               disabled           = (known after apply)
+               load_balancer_type = (known after apply)
            }

+           dns_cache_config {
+               enabled = false
            }

+           gce_persistent_disk_csi_driver_config {
+               enabled = (known after apply)
            }

+           gcp_filestore_csi_driver_config {
+               enabled = false
            }

+           horizontal_pod_autoscaling {
+               disabled = false
            }

+           http_load_balancing {
+               disabled = false
            }

+           network_policy_config {
+               disabled = true
            }
        }

+       authenticator_groups_config {
+           security_group = (known after apply)
        }

+       cluster_autoscaling {
+           enabled = false

+           auto_provisioning_defaults {
+               boot_disk_kms_key = (known after apply)
+               image_type        = (known after apply)
+               oauth_scopes      = (known after apply)
+               service_account   = (known after apply)
            }
        }

+       confidential_nodes {
+           enabled = (known after apply)
        }

+       database_encryption {
+           state = "DECRYPTED"
        }

+       default_snat_status {
+           disabled = false
        }

+       ip_allocation_policy {
+           cluster_ipv4_cidr_block       = (known after apply)
+           cluster_secondary_range_name  = "us-central1-01-gke-01-pods"
+           services_ipv4_cidr_block      = (known after apply)
+           services_secondary_range_name = "us-central1-01-gke-01-services"
        }

+       logging_config {
+           enable_components = (known after apply)
        }

+       maintenance_policy {
+           daily_maintenance_window {
+               duration   = (known after apply)
+               start_time = "05:00"
            }
        }

+       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
+           cluster_ca_certificate = (known after apply)

+           client_certificate_config {
+               issue_client_certificate = false
            }
        }

+       mesh_certificates {
+           enable_certificates = (known after apply)
        }

+       monitoring_config {
+           enable_components = (known after apply)
        }

+       network_policy {
+           enabled = false
        }

+       node_config {
+           boot_disk_kms_key = (known after apply)
+           disk_size_gb      = (known after apply)
+           disk_type         = (known after apply)
+           guest_accelerator = (known after apply)
+           image_type        = (known after apply)
+           labels            = (known after apply)
+           local_ssd_count   = (known after apply)
+           machine_type      = (known after apply)
+           metadata          = (known after apply)
+           min_cpu_platform  = (known after apply)
+           node_group        = (known after apply)
+           oauth_scopes      = (known after apply)
+           preemptible       = (known after apply)
+           service_account   = (known after apply)
+           spot              = (known after apply)
+           tags              = (known after apply)
+           taint             = (known after apply)

+           gcfs_config {
+               enabled = (known after apply)
            }

+           gvnic {
+               enabled = (known after apply)
            }

+           reservation_affinity {
+               consume_reservation_type = (known after apply)
+               key                      = (known after apply)
+               values                   = (known after apply)
            }

+           shielded_instance_config {
+               enable_integrity_monitoring = (known after apply)
+               enable_secure_boot          = (known after apply)
            }

+           workload_metadata_config {
+               mode = (known after apply)
            }
        }

+       node_pool {
+           initial_node_count          = 0
+           instance_group_urls         = (known after apply)
+           managed_instance_group_urls = (known after apply)
+           max_pods_per_node           = (known after apply)
+           name                        = "default-pool"
+           name_prefix                 = (known after apply)
+           node_count                  = (known after apply)
+           node_locations              = (known after apply)
+           version                     = (known after apply)

+           management {
+               auto_repair  = (known after apply)
+               auto_upgrade = (known after apply)
            }

+           node_config {
+               disk_size_gb      = (known after apply)
+               disk_type         = (known after apply)
+               guest_accelerator = (known after apply)
+               image_type        = "COS_CONTAINERD"
+               labels            = (known after apply)
+               local_ssd_count   = (known after apply)
+               machine_type      = "e2-medium"
+               metadata          = (known after apply)
+               min_cpu_platform  = (known after apply)
+               oauth_scopes      = (known after apply)
+               preemptible       = false
+               service_account   = "terrateam@terrateam-362405.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-default-pool",
                ]
+               taint             = (known after apply)

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = (known after apply)
+               max_unavailable = (known after apply)
            }
        }

+       notification_config {
+           pubsub {
+               enabled = false
            }
        }

+       release_channel {
+           channel = (known after apply)
        }

+       service_external_ips_config {
+           enabled = (known after apply)
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       vertical_pod_autoscaling {
+           enabled = false
        }

+       workload_identity_config {
+           workload_pool = "terrateam-362405.svc.id.goog"
        }
    }

  # module.gke.google_container_node_pool.pools["core"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "cinema"
+       id                          = (known after apply)
+       initial_node_count          = 1
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "core"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-b",
+           "us-central1-c",
        ]
+       operation                   = (known after apply)
+       project                     = "terrateam-362405"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 3
+           min_node_count = 1
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 15
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 0
+           machine_type      = "e2-medium"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = false
+           service_account   = "terrateam@terrateam-362405.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.gke.google_project_iam_member.cluster_service_account-log_writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-log_writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/logging.logWriter"
    }

  # module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-metric_writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/monitoring.metricWriter"
    }

  # module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/monitoring.viewer"
    }

  # module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke.google_service_account.cluster_service_account[0] will be created
+   resource "google_service_account" "cluster_service_account" {
+       account_id   = (known after apply)
+       disabled     = false
+       display_name = "Terraform-managed service account for cluster cinema"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "terrateam-362405"
+       unique_id    = (known after apply)
    }

  # module.gke.random_shuffle.available_zones will be created
+   resource "random_shuffle" "available_zones" {
+       id           = (known after apply)
+       input        = [
+           "us-central1-a",
+           "us-central1-b",
+           "us-central1-c",
+           "us-central1-f",
        ]
+       result       = (known after apply)
+       result_count = 3
    }

  # module.gke.random_string.cluster_service_account_suffix will be created
+   resource "random_string" "cluster_service_account_suffix" {
+       id          = (known after apply)
+       length      = 4
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   project = "terrateam-362405"

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
